# DefaultValueException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultValueException Class
Members See Also
---
The exception thrown when Revit cannot initialize a default value for a family parameter.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
[SerializableAttribute]
public class DefaultValueException : InvalidOperationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class DefaultValueException _
	Inherits InvalidOperationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class DefaultValueException : public InvalidOperationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..InvalidOperationException Autodesk.Revit.Exceptions..::..DefaultValueException
# See Also
DefaultValueException Members
Autodesk.Revit.Exceptions Namespace